; ModuleID = 'Results/lavaMD/util/device/device.cu'
source_filename = "Results/lavaMD/util/device/device.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [21 x i8] c"Cuda error: %s: %s.\0A\00", align 1

; Function Attrs: uwtable
define void @_Z9setdevicev() local_unnamed_addr #0 !dbg !648 {
entry:
  %num_devices = alloca i32, align 4
  %properties = alloca %struct.cudaDeviceProp, align 8
  %0 = bitcast i32* %num_devices to i8*, !dbg !730
  call void @llvm.lifetime.start(i64 4, i8* %0) #6, !dbg !730
  tail call void @llvm.dbg.value(metadata i32* %num_devices, i64 0, metadata !650, metadata !731), !dbg !732

!292 = !DISubprogram(name: "atan2", scope: !284, file: !284, line: 60, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{!232, !232, !232}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !296, line: 180)
!296 = !DISubprogram(name: "ceil", scope: !284, file: !284, line: 179, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !298, line: 199)
!298 = !DISubprogram(name: "cos", scope: !284, file: !284, line: 63, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !300, line: 218)
!300 = !DISubprogram(name: "cosh", scope: !284, file: !284, line: 72, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !302, line: 237)
!302 = !DISubprogram(name: "exp", scope: !284, file: !284, line: 100, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !304, line: 256)
!304 = !DISubprogram(name: "fabs", scope: !284, file: !284, line: 182, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !306, line: 275)
!306 = !DISubprogram(name: "floor", scope: !284, file: !284, line: 185, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !308, line: 294)
!308 = !DISubprogram(name: "fmod", scope: !284, file: !284, line: 188, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !310, line: 315)
!310 = !DISubprogram(name: "frexp", scope: !284, file: !284, line: 103, type: !311, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{!232, !232, !158}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !314, line: 334)
!314 = !DISubprogram(name: "ldexp", scope: !284, file: !284, line: 106, type: !315, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!315 = !DISubroutineType(types: !316)
!316 = !{!232, !232, !153}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !318, line: 353)
!318 = !DISubprogram(name: "log", scope: !284, file: !284, line: 109, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !320, line: 372)
!320 = !DISubprogram(name: "log10", scope: !284, file: !284, line: 112, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !322, line: 391)
!322 = !DISubprogram(name: "modf", scope: !284, file: !284, line: 115, type: !323, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{!232, !232, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !327, line: 403)
!327 = !DISubprogram(name: "pow", scope: !284, file: !284, line: 154, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !329, line: 440)
!329 = !DISubprogram(name: "sin", scope: !284, file: !284, line: 65, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !331, line: 459)
!331 = !DISubprogram(name: "sinh", scope: !284, file: !284, line: 74, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !333, line: 478)
!333 = !DISubprogram(name: "sqrt", scope: !284, file: !284, line: 157, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !335, line: 497)
!335 = !DISubprogram(name: "tan", scope: !284, file: !284, line: 67, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !337, line: 516)
!337 = !DISubprogram(name: "tanh", scope: !284, file: !284, line: 76, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !339, line: 118)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !340, line: 101, baseType: !341)
!340 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/ec2-user/DynamicAnalyis")
!341 = !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !343, line: 119)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !340, line: 109, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 105, size: 128, align: 64, elements: !345, identifier: "_ZTS6ldiv_t")
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !344, file: !340, line: 107, baseType: !192, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !344, file: !340, line: 108, baseType: !192, size: 64, align: 64, offset: 64)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !349, line: 121)
!349 = !DISubprogram(name: "abort", scope: !340, file: !340, line: 514, type: !350, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{null}
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !353, line: 122)
!353 = !DISubprogram(name: "abs", scope: !340, file: !340, line: 770, type: !354, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!153, !153}
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !357, line: 123)
!357 = !DISubprogram(name: "atexit", scope: !340, file: !340, line: 518, type: !358, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!153, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !362, line: 129)
!362 = !DISubprogram(name: "atof", scope: !363, file: !363, line: 26, type: !230, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!363 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "/home/ec2-user/DynamicAnalyis")
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !365, line: 130)
!365 = !DISubprogram(name: "atoi", scope: !340, file: !340, line: 278, type: !366, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!153, !233}
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !369, line: 131)
!369 = !DISubprogram(name: "atol", scope: !340, file: !340, line: 283, type: !370, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{!192, !233}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !373, line: 132)
!373 = !DISubprogram(name: "bsearch", scope: !340, file: !340, line: 754, type: !374, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !377, !377, !379, !379, !382}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !380, line: 62, baseType: !381)
!380 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/ec2-user/DynamicAnalyis")
!381 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !340, line: 741, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!153, !377, !377}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !387, line: 133)
!387 = !DISubprogram(name: "calloc", scope: !340, file: !340, line: 467, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!376, !379, !379}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !391, line: 134)
!391 = !DISubprogram(name: "div", scope: !340, file: !340, line: 784, type: !392, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{!339, !153, !153}
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !395, line: 135)
!395 = !DISubprogram(name: "exit", scope: !340, file: !340, line: 542, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !153}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !399, line: 136)
!399 = !DISubprogram(name: "free", scope: !340, file: !340, line: 482, type: !400, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !376}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !403, line: 137)
!403 = !DISubprogram(name: "getenv", scope: !340, file: !340, line: 563, type: !404, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !233}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !408, line: 138)
!408 = !DISubprogram(name: "labs", scope: !340, file: !340, line: 771, type: !190, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !410, line: 139)
!410 = !DISubprogram(name: "ldiv", scope: !340, file: !340, line: 786, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{!343, !192, !192}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !414, line: 140)
!414 = !DISubprogram(name: "malloc", scope: !340, file: !340, line: 465, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{!376, !379}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !418, line: 142)
!418 = !DISubprogram(name: "mblen", scope: !340, file: !340, line: 859, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!153, !233, !379}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !422, line: 143)
!422 = !DISubprogram(name: "mbstowcs", scope: !340, file: !340, line: 870, type: !423, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!379, !425, !428, !379}
!425 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!428 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !233)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !430, line: 144)
!430 = !DISubprogram(name: "mbtowc", scope: !340, file: !340, line: 862, type: !431, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!153, !425, !428, !379}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !434, line: 146)
!434 = !DISubprogram(name: "qsort", scope: !340, file: !340, line: 760, type: !435, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !376, !379, !379, !382}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !438, line: 152)
!438 = !DISubprogram(name: "rand", scope: !340, file: !340, line: 374, type: !439, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!153}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !442, line: 153)
!442 = !DISubprogram(name: "realloc", scope: !340, file: !340, line: 479, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!376, !376, !379}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !446, line: 154)
!446 = !DISubprogram(name: "srand", scope: !340, file: !340, line: 376, type: !447, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449}
!449 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !451, line: 155)
!451 = !DISubprogram(name: "strtod", scope: !340, file: !340, line: 164, type: !452, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!232, !428, !454}
!454 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !457, line: 156)
!457 = !DISubprogram(name: "strtol", scope: !340, file: !340, line: 183, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!458 = !DISubroutineType(types: !459)
!459 = !{!192, !428, !454, !153}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !461, line: 157)
!461 = !DISubprogram(name: "strtoul", scope: !340, file: !340, line: 187, type: !462, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!381, !428, !454, !153}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !465, line: 158)
!465 = !DISubprogram(name: "system", scope: !340, file: !340, line: 716, type: !366, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !467, line: 160)
!467 = !DISubprogram(name: "wcstombs", scope: !340, file: !340, line: 873, type: !468, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!379, !470, !471, !379}
!470 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !406)
!471 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !475, line: 161)
!475 = !DISubprogram(name: "wctomb", scope: !340, file: !340, line: 866, type: !476, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{!153, !406, !427}
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !481, line: 201)
!479 = !DINamespace(name: "__gnu_cxx", scope: null, file: !480, line: 68)
!480 = !DIFile(filename: "/usr/include/c++/4.8.3/bits/cpp_type_traits.h", directory: "/home/ec2-user/DynamicAnalyis")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !340, line: 121, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 117, size: 128, align: 64, elements: !483, identifier: "_ZTS7lldiv_t")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !482, file: !340, line: 119, baseType: !93, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !482, file: !340, line: 120, baseType: !93, size: 64, align: 64, offset: 64)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !487, line: 207)
!487 = !DISubprogram(name: "_Exit", scope: !340, file: !340, line: 556, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !489, line: 211)
!489 = !DISubprogram(name: "llabs", scope: !340, file: !340, line: 775, type: !91, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !491, line: 217)
!491 = !DISubprogram(name: "lldiv", scope: !340, file: !340, line: 792, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{!481, !93, !93}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !495, line: 228)
!495 = !DISubprogram(name: "atoll", scope: !340, file: !340, line: 292, type: !496, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{!93, !233}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !499, line: 229)
!499 = !DISubprogram(name: "strtoll", scope: !340, file: !340, line: 209, type: !500, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!500 = !DISubroutineType(types: !501)
!501 = !{!93, !428, !454, !153}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !503, line: 230)
!503 = !DISubprogram(name: "strtoull", scope: !340, file: !340, line: 214, type: !504, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !428, !454, !153}
!506 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !508, line: 232)
!508 = !DISubprogram(name: "strtof", scope: !340, file: !340, line: 172, type: !509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{!98, !428, !454}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !512, line: 233)
!512 = !DISubprogram(name: "strtold", scope: !340, file: !340, line: 175, type: !513, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !428, !454}
!515 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !481, line: 241)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !487, line: 243)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !489, line: 245)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !520, line: 246)
!520 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !479, file: !521, line: 214, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!521 = !DIFile(filename: "/usr/include/c++/4.8.3/cstdlib", directory: "/home/ec2-user/DynamicAnalyis")
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !491, line: 247)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !495, line: 249)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !508, line: 250)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !499, line: 251)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !503, line: 252)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !512, line: 253)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !529, line: 366)
!529 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !530, file: !530, line: 1300, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/ec2-user/DynamicAnalyis")
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !532, line: 367)
!532 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !530, file: !530, line: 1328, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !534, line: 368)
!534 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !530, file: !530, line: 1295, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !536, line: 369)
!536 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !530, file: !530, line: 1333, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !538, line: 370)
!538 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !530, file: !530, line: 1285, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !540, line: 371)
!540 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !530, file: !530, line: 1290, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !542, line: 372)
!542 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !530, file: !530, line: 1338, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !544, line: 373)
!544 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !530, file: !530, line: 1388, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !546, line: 374)
!546 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !547, file: !547, line: 667, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!547 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/ec2-user/DynamicAnalyis")
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !549, line: 375)
!549 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !530, file: !530, line: 1147, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !551, line: 376)
!551 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !530, file: !530, line: 1201, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !553, line: 377)
!553 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !530, file: !530, line: 1270, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !555, line: 378)
!555 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !530, file: !530, line: 1448, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !557, line: 379)
!557 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !530, file: !530, line: 1438, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !559, line: 380)
!559 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !547, file: !547, line: 657, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !561, line: 381)
!561 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !530, file: !530, line: 1252, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !563, line: 382)
!563 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !530, file: !530, line: 1343, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !565, line: 383)
!565 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !547, file: !547, line: 607, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !567, line: 384)
!567 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !530, file: !530, line: 1574, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !569, line: 385)
!569 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !547, file: !547, line: 597, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !571, line: 386)
!571 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !530, file: !530, line: 1526, type: !141, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !573, line: 387)
!573 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !547, file: !547, line: 622, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !575, line: 388)
!575 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !547, file: !547, line: 617, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !577, line: 389)
!577 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !530, file: !530, line: 1511, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !579, line: 390)
!579 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !530, file: !530, line: 1501, type: !156, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !581, line: 391)
!581 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !530, file: !530, line: 1348, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !583, line: 392)
!583 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !530, file: !530, line: 1579, type: !151, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !585, line: 393)
!585 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !530, file: !530, line: 1478, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !587, line: 394)
!587 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !530, file: !530, line: 1473, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !589, line: 395)
!589 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !530, file: !530, line: 1107, type: !203, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !591, line: 396)
!591 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !530, file: !530, line: 1560, type: !203, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !593, line: 397)
!593 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !530, file: !530, line: 1314, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !595, line: 398)
!595 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !530, file: !530, line: 1323, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !597, line: 399)
!597 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !530, file: !530, line: 1243, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !599, line: 400)
!599 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !530, file: !530, line: 1584, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !601, line: 401)
!601 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !530, file: !530, line: 1305, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !603, line: 402)
!603 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !530, file: !530, line: 1098, type: !217, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !605, line: 403)
!605 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !530, file: !530, line: 1565, type: !217, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !607, line: 404)
!607 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !530, file: !530, line: 1506, type: !225, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !609, line: 405)
!609 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !530, file: !530, line: 1112, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !611, line: 406)
!611 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !530, file: !530, line: 1176, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !613, line: 407)
!613 = !DISubprogram(name: "nexttowardf", scope: !284, file: !284, line: 285, type: !614, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!614 = !DISubroutineType(types: !615)
!615 = !{!98, !98, !515}
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !613, line: 408)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !618, line: 409)
!618 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !530, file: !530, line: 1541, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !620, line: 410)
!620 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !530, file: !530, line: 1516, type: !109, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !622, line: 411)
!622 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !530, file: !530, line: 1521, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !624, line: 412)
!624 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !530, file: !530, line: 1093, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !626, line: 413)
!626 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !530, file: !530, line: 1555, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !628, line: 414)
!628 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !530, file: !530, line: 1488, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !630, line: 415)
!630 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !530, file: !530, line: 1483, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !632, line: 416)
!632 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !530, file: !530, line: 1192, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !634, line: 417)
!634 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !530, file: !530, line: 1275, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !636, line: 418)
!636 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !547, file: !547, line: 907, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !638, line: 419)
!638 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !530, file: !530, line: 1234, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !640, line: 420)
!640 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !530, file: !530, line: 1280, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !642, line: 421)
!642 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !530, file: !530, line: 1550, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !88, entity: !644, line: 422)
!644 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !547, file: !547, line: 662, type: !96, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!645 = !{i32 2, !"Dwarf Version", i32 4}
!646 = !{i32 2, !"Debug Info Version", i32 3}
!647 = !{!"clang version 4.0.0 (trunk 279478) (llvm/trunk 279476)"}
!648 = distinct !DISubprogram(name: "setdevice", linkageName: "_Z9setdevicev", scope: !1, file: !1, line: 19, type: !350, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !649)
!649 = !{!650, !651, !652, !655, !656}
!650 = !DILocalVariable(name: "num_devices", scope: !648, file: !1, line: 22, type: !153)
!651 = !DILocalVariable(name: "device", scope: !648, file: !1, line: 23, type: !153)
!652 = !DILocalVariable(name: "max_multiprocessors", scope: !653, file: !1, line: 30, type: !153)
!653 = distinct !DILexicalBlock(scope: !654, file: !1, line: 27, column: 23)
!654 = distinct !DILexicalBlock(scope: !648, file: !1, line: 27, column: 6)
!655 = !DILocalVariable(name: "max_device", scope: !653, file: !1, line: 31, type: !153)
!656 = !DILocalVariable(name: "properties", scope: !653, file: !1, line: 32, type: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !4, line: 1258, size: 5056, align: 64, elements: !658, identifier: "_ZTS14cudaDeviceProp")
!658 = !{!659, !663, !664, !665, !666, !667, !668, !669, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !4, line: 1260, baseType: !660, size: 2048, align: 8)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 2048, align: 8, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !657, file: !4, line: 1261, baseType: !379, size: 64, align: 64, offset: 2048)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !657, file: !4, line: 1262, baseType: !379, size: 64, align: 64, offset: 2112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !657, file: !4, line: 1263, baseType: !153, size: 32, align: 32, offset: 2176)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !657, file: !4, line: 1264, baseType: !153, size: 32, align: 32, offset: 2208)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !657, file: !4, line: 1265, baseType: !379, size: 64, align: 64, offset: 2240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !657, file: !4, line: 1266, baseType: !153, size: 32, align: 32, offset: 2304)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !657, file: !4, line: 1267, baseType: !670, size: 96, align: 32, offset: 2336)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, align: 32, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 3)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !657, file: !4, line: 1268, baseType: !670, size: 96, align: 32, offset: 2432)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !657, file: !4, line: 1269, baseType: !153, size: 32, align: 32, offset: 2528)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !657, file: !4, line: 1270, baseType: !379, size: 64, align: 64, offset: 2560)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !657, file: !4, line: 1271, baseType: !153, size: 32, align: 32, offset: 2624)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !657, file: !4, line: 1272, baseType: !153, size: 32, align: 32, offset: 2656)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !657, file: !4, line: 1273, baseType: !379, size: 64, align: 64, offset: 2688)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !657, file: !4, line: 1274, baseType: !379, size: 64, align: 64, offset: 2752)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !657, file: !4, line: 1275, baseType: !153, size: 32, align: 32, offset: 2816)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !657, file: !4, line: 1276, baseType: !153, size: 32, align: 32, offset: 2848)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !657, file: !4, line: 1277, baseType: !153, size: 32, align: 32, offset: 2880)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !657, file: !4, line: 1278, baseType: !153, size: 32, align: 32, offset: 2912)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !657, file: !4, line: 1279, baseType: !153, size: 32, align: 32, offset: 2944)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !657, file: !4, line: 1280, baseType: !153, size: 32, align: 32, offset: 2976)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !657, file: !4, line: 1281, baseType: !153, size: 32, align: 32, offset: 3008)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !657, file: !4, line: 1282, baseType: !153, size: 32, align: 32, offset: 3040)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !657, file: !4, line: 1283, baseType: !153, size: 32, align: 32, offset: 3072)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !657, file: !4, line: 1284, baseType: !690, size: 64, align: 32, offset: 3104)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, align: 32, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 2)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !657, file: !4, line: 1285, baseType: !690, size: 64, align: 32, offset: 3168)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !657, file: !4, line: 1286, baseType: !670, size: 96, align: 32, offset: 3232)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !657, file: !4, line: 1287, baseType: !690, size: 64, align: 32, offset: 3328)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !657, file: !4, line: 1288, baseType: !670, size: 96, align: 32, offset: 3392)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !657, file: !4, line: 1289, baseType: !670, size: 96, align: 32, offset: 3488)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !657, file: !4, line: 1290, baseType: !153, size: 32, align: 32, offset: 3584)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !657, file: !4, line: 1291, baseType: !690, size: 64, align: 32, offset: 3616)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !657, file: !4, line: 1292, baseType: !670, size: 96, align: 32, offset: 3680)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !657, file: !4, line: 1293, baseType: !690, size: 64, align: 32, offset: 3776)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !657, file: !4, line: 1294, baseType: !153, size: 32, align: 32, offset: 3840)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !657, file: !4, line: 1295, baseType: !690, size: 64, align: 32, offset: 3872)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !657, file: !4, line: 1296, baseType: !670, size: 96, align: 32, offset: 3936)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !657, file: !4, line: 1297, baseType: !690, size: 64, align: 32, offset: 4032)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !657, file: !4, line: 1298, baseType: !670, size: 96, align: 32, offset: 4096)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !657, file: !4, line: 1299, baseType: !153, size: 32, align: 32, offset: 4192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !657, file: !4, line: 1300, baseType: !690, size: 64, align: 32, offset: 4224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !657, file: !4, line: 1301, baseType: !379, size: 64, align: 64, offset: 4288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !657, file: !4, line: 1302, baseType: !153, size: 32, align: 32, offset: 4352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !657, file: !4, line: 1303, baseType: !153, size: 32, align: 32, offset: 4384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !657, file: !4, line: 1304, baseType: !153, size: 32, align: 32, offset: 4416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !657, file: !4, line: 1305, baseType: !153, size: 32, align: 32, offset: 4448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !657, file: !4, line: 1306, baseType: !153, size: 32, align: 32, offset: 4480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !657, file: !4, line: 1307, baseType: !153, size: 32, align: 32, offset: 4512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !657, file: !4, line: 1308, baseType: !153, size: 32, align: 32, offset: 4544)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !657, file: !4, line: 1309, baseType: !153, size: 32, align: 32, offset: 4576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !657, file: !4, line: 1310, baseType: !153, size: 32, align: 32, offset: 4608)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !657, file: !4, line: 1311, baseType: !153, size: 32, align: 32, offset: 4640)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !657, file: !4, line: 1312, baseType: !153, size: 32, align: 32, offset: 4672)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !657, file: !4, line: 1313, baseType: !153, size: 32, align: 32, offset: 4704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !657, file: !4, line: 1314, baseType: !153, size: 32, align: 32, offset: 4736)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !657, file: !4, line: 1315, baseType: !153, size: 32, align: 32, offset: 4768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !657, file: !4, line: 1316, baseType: !153, size: 32, align: 32, offset: 4800)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !657, file: !4, line: 1317, baseType: !379, size: 64, align: 64, offset: 4864)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !657, file: !4, line: 1318, baseType: !153, size: 32, align: 32, offset: 4928)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !657, file: !4, line: 1319, baseType: !153, size: 32, align: 32, offset: 4960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !657, file: !4, line: 1320, baseType: !153, size: 32, align: 32, offset: 4992)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !657, file: !4, line: 1321, baseType: !153, size: 32, align: 32, offset: 5024)
!730 = !DILocation(line: 22, column: 2, scope: !648)
!731 = !DIExpression(DW_OP_deref)
!732 = !DILocation(line: 22, column: 6, scope: !648)
!733 = !DILocation(line: 26, column: 2, scope: !648)
!734 = !DILocation(line: 38, column: 29, scope: !735)
!735 = !DILexicalBlockFile(scope: !736, file: !1, discriminator: 1)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 38, column: 3)
!737 = distinct !DILexicalBlock(scope: !653, file: !1, line: 38, column: 3)
!738 = !{!739, !739, i64 0}
!739 = !{!"int", !740, i64 0}
!740 = !{!"omnipotent char", !741, i64 0}
!741 = !{!"Simple C++ TBAA"}
!742 = !DIExpression()
!743 = !DILocation(line: 27, column: 18, scope: !654)
!744 = !DILocation(line: 27, column: 6, scope: !648)
!745 = !DILocation(line: 32, column: 3, scope: !653)
!746 = !DILocation(line: 30, column: 7, scope: !653)
!747 = !DILocation(line: 31, column: 7, scope: !653)
!748 = !DILocation(line: 23, column: 6, scope: !648)
!749 = !DILocation(line: 40, column: 41, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 40, column: 8)
!751 = distinct !DILexicalBlock(scope: !736, file: !1, line: 38, column: 52)
!752 = !DILocation(line: 38, column: 3, scope: !735)
!753 = !DILocation(line: 32, column: 18, scope: !653)
!754 = !DILocation(line: 39, column: 4, scope: !751)
!755 = !{!756, !739, i64 356}
!756 = !{!"_ZTS14cudaDeviceProp", !740, i64 0, !757, i64 256, !757, i64 264, !739, i64 272, !739, i64 276, !757, i64 280, !739, i64 288, !740, i64 292, !740, i64 304, !739, i64 316, !757, i64 320, !739, i64 328, !739, i64 332, !757, i64 336, !757, i64 344, !739, i64 352, !739, i64 356, !739, i64 360, !739, i64 364, !739, i64 368, !739, i64 372, !739, i64 376, !739, i64 380, !739, i64 384, !740, i64 388, !740, i64 396, !740, i64 404, !740, i64 416, !740, i64 424, !740, i64 436, !739, i64 448, !740, i64 452, !740, i64 460, !740, i64 472, !739, i64 480, !740, i64 484, !740, i64 492, !740, i64 504, !740, i64 512, !739, i64 524, !740, i64 528, !757, i64 536, !739, i64 544, !739, i64 548, !739, i64 552, !739, i64 556, !739, i64 560, !739, i64 564, !739, i64 568, !739, i64 572, !739, i64 576, !739, i64 580, !739, i64 584, !739, i64 588, !739, i64 592, !739, i64 596, !739, i64 600, !757, i64 608, !739, i64 616, !739, i64 620, !739, i64 624, !739, i64 628}
!757 = !{!"long", !740, i64 0}
!758 = !DILocation(line: 40, column: 28, scope: !750)
!759 = !DILocation(line: 40, column: 8, scope: !751)
!760 = !DILocation(line: 38, column: 48, scope: !761)
!761 = !DILexicalBlockFile(scope: !736, file: !1, discriminator: 2)
!762 = !DILocation(line: 38, column: 27, scope: !735)
!763 = distinct !{!763, !764}
!764 = !DILocation(line: 38, column: 3, scope: !653)
!765 = !DILocation(line: 45, column: 3, scope: !653)
!766 = !DILocation(line: 46, column: 2, scope: !654)
!767 = !DILocation(line: 46, column: 2, scope: !653)
!768 = !DILocation(line: 48, column: 1, scope: !648)
!769 = distinct !DISubprogram(name: "checkCUDAError", linkageName: "_Z14checkCUDAErrorPKc", scope: !1, file: !1, line: 54, type: !770, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !233}
!772 = !{!773, !774}
!773 = !DILocalVariable(name: "msg", arg: 1, scope: !769, file: !1, line: 54, type: !233)
!774 = !DILocalVariable(name: "err", scope: !769, file: !1, line: 56, type: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "cudaError_t", file: !4, line: 1420, baseType: !3)
!776 = !DILocation(line: 54, column: 33, scope: !769)
!777 = !DILocation(line: 56, column: 20, scope: !769)
!778 = !DILocation(line: 56, column: 14, scope: !769)
!779 = !DILocation(line: 57, column: 18, scope: !780)
!780 = distinct !DILexicalBlock(scope: !769, file: !1, line: 57, column: 6)
!781 = !DILocation(line: 57, column: 6, scope: !769)
