; ModuleID = 'main-device-cuda-nvptx64-nvidia-cuda-sm_30.ll'
source_filename = "Results/heartwall/main.cu"
target datalayout = "e-i64:64-v16:16-v32:32-n16:32:64"
target triple = "nvptx64-nvidia-cuda"

%struct.params_common_change = type { float*, i32 }
%struct.params_common = type { i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.params_unique = type { i32*, i32*, i32*, i32*, float*, i32, i32, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float* }
%printf_args = type { i8*, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [27 x i8] c"DA__\09%s\09%s\09%d\09%s\09%d\09%d\09%d\0A\00", align 1
@d_common_change = local_unnamed_addr addrspace(4) externally_initialized global %struct.params_common_change zeroinitializer, align 8
@d_common = local_unnamed_addr addrspace(4) externally_initialized global %struct.params_common zeroinitializer, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 4.0.0 (trunk 279478) (llvm/trunk 279476)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !11, imports: !240)
!1 = !DIFile(filename: "Results/heartwall/main.cu", directory: "/home/ec2-user/DynamicAnalyis")
!2 = !{}
!3 = !{!4, !9, !10}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !5, line: 4, baseType: !6)
!5 = !DIFile(filename: "./dynamicAnalysisCode.cu", directory: "/home/ec2-user/DynamicAnalyis")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 55, baseType: !8)
!7 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ec2-user/DynamicAnalyis")
!8 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !{!12, !20, !135, !163, !223, !224, !225, !226, !227, !231, !233, !237}
!12 = distinct !DIGlobalVariable(name: "d_common_change", scope: !0, file: !1, line: 26, type: !13, isLocal: false, isDefinition: true, variable: %struct.params_common_change addrspace(4)* @d_common_change)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common_change", file: !14, line: 40, baseType: !15)
!14 = !DIFile(filename: "Results/heartwall/define.c", directory: "/home/ec2-user/DynamicAnalyis")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common_change", file: !14, line: 31, size: 128, align: 64, elements: !16, identifier: "_ZTS20params_common_change")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "d_frame", scope: !15, file: !14, line: 37, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !15, file: !14, line: 38, baseType: !9, size: 32, align: 32, offset: 64)
!20 = distinct !DIGlobalVariable(name: "d_common", scope: !0, file: !1, line: 29, type: !21, isLocal: false, isDefinition: true, variable: %struct.params_common addrspace(4)* @d_common)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common", file: !14, line: 272, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common", file: !14, line: 48, size: 4160, align: 64, elements: !23, identifier: "_ZTS13params_common")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sSize", scope: !22, file: !14, line: 58, baseType: !9, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tSize", scope: !22, file: !14, line: 59, baseType: !9, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "maxMove", scope: !22, file: !14, line: 60, baseType: !9, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !22, file: !14, line: 61, baseType: !10, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "no_frames", scope: !22, file: !14, line: 67, baseType: !9, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rows", scope: !22, file: !14, line: 68, baseType: !9, size: 32, align: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cols", scope: !22, file: !14, line: 69, baseType: !9, size: 32, align: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "frame_elem", scope: !22, file: !14, line: 70, baseType: !9, size: 32, align: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mem", scope: !22, file: !14, line: 71, baseType: !9, size: 32, align: 32, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "endoPoints", scope: !22, file: !14, line: 77, baseType: !9, size: 32, align: 32, offset: 288)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "endo_mem", scope: !22, file: !14, line: 78, baseType: !9, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "endoRow", scope: !22, file: !14, line: 80, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "endoCol", scope: !22, file: !14, line: 81, baseType: !36, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoRowLoc", scope: !22, file: !14, line: 82, baseType: !36, size: 64, align: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoColLoc", scope: !22, file: !14, line: 83, baseType: !36, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoRow", scope: !22, file: !14, line: 85, baseType: !36, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoCol", scope: !22, file: !14, line: 86, baseType: !36, size: 64, align: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoRowLoc", scope: !22, file: !14, line: 87, baseType: !36, size: 64, align: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoColLoc", scope: !22, file: !14, line: 88, baseType: !36, size: 64, align: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoT", scope: !22, file: !14, line: 90, baseType: !18, size: 64, align: 64, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "epiPoints", scope: !22, file: !14, line: 95, baseType: !9, size: 32, align: 32, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "epi_mem", scope: !22, file: !14, line: 96, baseType: !9, size: 32, align: 32, offset: 992)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "epiRow", scope: !22, file: !14, line: 98, baseType: !36, size: 64, align: 64, offset: 1024)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "epiCol", scope: !22, file: !14, line: 99, baseType: !36, size: 64, align: 64, offset: 1088)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiRowLoc", scope: !22, file: !14, line: 100, baseType: !36, size: 64, align: 64, offset: 1152)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiColLoc", scope: !22, file: !14, line: 101, baseType: !36, size: 64, align: 64, offset: 1216)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiRow", scope: !22, file: !14, line: 103, baseType: !36, size: 64, align: 64, offset: 1280)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiCol", scope: !22, file: !14, line: 104, baseType: !36, size: 64, align: 64, offset: 1344)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiRowLoc", scope: !22, file: !14, line: 105, baseType: !36, size: 64, align: 64, offset: 1408)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiColLoc", scope: !22, file: !14, line: 106, baseType: !36, size: 64, align: 64, offset: 1472)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiT", scope: !22, file: !14, line: 108, baseType: !18, size: 64, align: 64, offset: 1536)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "allPoints", scope: !22, file: !14, line: 114, baseType: !9, size: 32, align: 32, offset: 1600)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "in_rows", scope: !22, file: !14, line: 120, baseType: !9, size: 32, align: 32, offset: 1632)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "in_cols", scope: !22, file: !14, line: 121, baseType: !9, size: 32, align: 32, offset: 1664)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "in_elem", scope: !22, file: !14, line: 122, baseType: !9, size: 32, align: 32, offset: 1696)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "in_mem", scope: !22, file: !14, line: 123, baseType: !9, size: 32, align: 32, offset: 1728)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "in2_rows", scope: !22, file: !14, line: 129, baseType: !9, size: 32, align: 32, offset: 1760)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "in2_cols", scope: !22, file: !14, line: 130, baseType: !9, size: 32, align: 32, offset: 1792)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "in2_elem", scope: !22, file: !14, line: 131, baseType: !9, size: 32, align: 32, offset: 1824)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "in2_mem", scope: !22, file: !14, line: 132, baseType: !9, size: 32, align: 32, offset: 1856)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "conv_rows", scope: !22, file: !14, line: 138, baseType: !9, size: 32, align: 32, offset: 1888)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "conv_cols", scope: !22, file: !14, line: 139, baseType: !9, size: 32, align: 32, offset: 1920)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "conv_elem", scope: !22, file: !14, line: 140, baseType: !9, size: 32, align: 32, offset: 1952)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "conv_mem", scope: !22, file: !14, line: 141, baseType: !9, size: 32, align: 32, offset: 1984)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !22, file: !14, line: 142, baseType: !9, size: 32, align: 32, offset: 2016)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "joffset", scope: !22, file: !14, line: 143, baseType: !9, size: 32, align: 32, offset: 2048)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_rows", scope: !22, file: !14, line: 153, baseType: !9, size: 32, align: 32, offset: 2080)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_cols", scope: !22, file: !14, line: 154, baseType: !9, size: 32, align: 32, offset: 2112)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_rows", scope: !22, file: !14, line: 155, baseType: !9, size: 32, align: 32, offset: 2144)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_cols", scope: !22, file: !14, line: 156, baseType: !9, size: 32, align: 32, offset: 2176)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_elem", scope: !22, file: !14, line: 157, baseType: !9, size: 32, align: 32, offset: 2208)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_mem", scope: !22, file: !14, line: 158, baseType: !9, size: 32, align: 32, offset: 2240)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rows", scope: !22, file: !14, line: 164, baseType: !9, size: 32, align: 32, offset: 2272)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_cols", scope: !22, file: !14, line: 165, baseType: !9, size: 32, align: 32, offset: 2304)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_elem", scope: !22, file: !14, line: 166, baseType: !9, size: 32, align: 32, offset: 2336)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_mem", scope: !22, file: !14, line: 167, baseType: !9, size: 32, align: 32, offset: 2368)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowlow", scope: !22, file: !14, line: 168, baseType: !9, size: 32, align: 32, offset: 2400)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowhig", scope: !22, file: !14, line: 169, baseType: !9, size: 32, align: 32, offset: 2432)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_collow", scope: !22, file: !14, line: 170, baseType: !9, size: 32, align: 32, offset: 2464)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_colhig", scope: !22, file: !14, line: 171, baseType: !9, size: 32, align: 32, offset: 2496)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowlow", scope: !22, file: !14, line: 177, baseType: !9, size: 32, align: 32, offset: 2528)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowhig", scope: !22, file: !14, line: 178, baseType: !9, size: 32, align: 32, offset: 2560)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_collow", scope: !22, file: !14, line: 179, baseType: !9, size: 32, align: 32, offset: 2592)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_colhig", scope: !22, file: !14, line: 180, baseType: !9, size: 32, align: 32, offset: 2624)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_rows", scope: !22, file: !14, line: 181, baseType: !9, size: 32, align: 32, offset: 2656)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_cols", scope: !22, file: !14, line: 182, baseType: !9, size: 32, align: 32, offset: 2688)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_elem", scope: !22, file: !14, line: 183, baseType: !9, size: 32, align: 32, offset: 2720)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_mem", scope: !22, file: !14, line: 184, baseType: !9, size: 32, align: 32, offset: 2752)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rows", scope: !22, file: !14, line: 190, baseType: !9, size: 32, align: 32, offset: 2784)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_cols", scope: !22, file: !14, line: 191, baseType: !9, size: 32, align: 32, offset: 2816)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_elem", scope: !22, file: !14, line: 192, baseType: !9, size: 32, align: 32, offset: 2848)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_mem", scope: !22, file: !14, line: 193, baseType: !9, size: 32, align: 32, offset: 2880)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowlow", scope: !22, file: !14, line: 194, baseType: !9, size: 32, align: 32, offset: 2912)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowhig", scope: !22, file: !14, line: 195, baseType: !9, size: 32, align: 32, offset: 2944)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_collow", scope: !22, file: !14, line: 196, baseType: !9, size: 32, align: 32, offset: 2976)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_colhig", scope: !22, file: !14, line: 197, baseType: !9, size: 32, align: 32, offset: 3008)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowlow", scope: !22, file: !14, line: 203, baseType: !9, size: 32, align: 32, offset: 3040)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowhig", scope: !22, file: !14, line: 204, baseType: !9, size: 32, align: 32, offset: 3072)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_collow", scope: !22, file: !14, line: 205, baseType: !9, size: 32, align: 32, offset: 3104)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_colhig", scope: !22, file: !14, line: 206, baseType: !9, size: 32, align: 32, offset: 3136)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_rows", scope: !22, file: !14, line: 207, baseType: !9, size: 32, align: 32, offset: 3168)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_cols", scope: !22, file: !14, line: 208, baseType: !9, size: 32, align: 32, offset: 3200)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_elem", scope: !22, file: !14, line: 209, baseType: !9, size: 32, align: 32, offset: 3232)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_mem", scope: !22, file: !14, line: 210, baseType: !9, size: 32, align: 32, offset: 3264)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_rows", scope: !22, file: !14, line: 220, baseType: !9, size: 32, align: 32, offset: 3296)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_cols", scope: !22, file: !14, line: 221, baseType: !9, size: 32, align: 32, offset: 3328)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_elem", scope: !22, file: !14, line: 222, baseType: !9, size: 32, align: 32, offset: 3360)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_mem", scope: !22, file: !14, line: 223, baseType: !9, size: 32, align: 32, offset: 3392)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_rows", scope: !22, file: !14, line: 229, baseType: !9, size: 32, align: 32, offset: 3424)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_cols", scope: !22, file: !14, line: 230, baseType: !9, size: 32, align: 32, offset: 3456)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_elem", scope: !22, file: !14, line: 231, baseType: !9, size: 32, align: 32, offset: 3488)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_mem", scope: !22, file: !14, line: 232, baseType: !9, size: 32, align: 32, offset: 3520)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_rows", scope: !22, file: !14, line: 238, baseType: !9, size: 32, align: 32, offset: 3552)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_cols", scope: !22, file: !14, line: 239, baseType: !9, size: 32, align: 32, offset: 3584)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_elem", scope: !22, file: !14, line: 240, baseType: !9, size: 32, align: 32, offset: 3616)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_mem", scope: !22, file: !14, line: 241, baseType: !9, size: 32, align: 32, offset: 3648)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_rows", scope: !22, file: !14, line: 247, baseType: !9, size: 32, align: 32, offset: 3680)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_cols", scope: !22, file: !14, line: 248, baseType: !9, size: 32, align: 32, offset: 3712)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_elem", scope: !22, file: !14, line: 249, baseType: !9, size: 32, align: 32, offset: 3744)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_mem", scope: !22, file: !14, line: 250, baseType: !9, size: 32, align: 32, offset: 3776)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mask_rows", scope: !22, file: !14, line: 256, baseType: !9, size: 32, align: 32, offset: 3808)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mask_cols", scope: !22, file: !14, line: 257, baseType: !9, size: 32, align: 32, offset: 3840)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mask_elem", scope: !22, file: !14, line: 258, baseType: !9, size: 32, align: 32, offset: 3872)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mask_mem", scope: !22, file: !14, line: 259, baseType: !9, size: 32, align: 32, offset: 3904)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_rows", scope: !22, file: !14, line: 265, baseType: !9, size: 32, align: 32, offset: 3936)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_cols", scope: !22, file: !14, line: 266, baseType: !9, size: 32, align: 32, offset: 3968)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_elem", scope: !22, file: !14, line: 267, baseType: !9, size: 32, align: 32, offset: 4000)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_mem", scope: !22, file: !14, line: 268, baseType: !9, size: 32, align: 32, offset: 4032)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_ioffset", scope: !22, file: !14, line: 269, baseType: !9, size: 32, align: 32, offset: 4064)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_joffset", scope: !22, file: !14, line: 270, baseType: !9, size: 32, align: 32, offset: 4096)
!135 = distinct !DIGlobalVariable(name: "d_unique", scope: !0, file: !1, line: 32, type: !136, isLocal: false, isDefinition: true, variable: [51 x %struct.params_unique] addrspace(4)* @d_unique)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 65280, align: 64, elements: !161)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_unique", file: !14, line: 391, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_unique", file: !14, line: 280, size: 1280, align: 64, elements: !139, identifier: "_ZTS13params_unique")
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "d_Row", scope: !138, file: !14, line: 286, baseType: !36, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "d_Col", scope: !138, file: !14, line: 287, baseType: !36, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "d_tRowLoc", scope: !138, file: !14, line: 288, baseType: !36, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "d_tColLoc", scope: !138, file: !14, line: 289, baseType: !36, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "d_T", scope: !138, file: !14, line: 290, baseType: !18, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "point_no", scope: !138, file: !14, line: 296, baseType: !9, size: 32, align: 32, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "in_pointer", scope: !138, file: !14, line: 302, baseType: !9, size: 32, align: 32, offset: 352)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2", scope: !138, file: !14, line: 308, baseType: !18, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d_conv", scope: !138, file: !14, line: 314, baseType: !18, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_mod", scope: !138, file: !14, line: 315, baseType: !18, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv", scope: !138, file: !14, line: 325, baseType: !18, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv_sel", scope: !138, file: !14, line: 331, baseType: !18, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh", scope: !138, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh_sel", scope: !138, file: !14, line: 343, baseType: !18, size: 64, align: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub2", scope: !138, file: !14, line: 349, baseType: !18, size: 64, align: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr", scope: !138, file: !14, line: 359, baseType: !18, size: 64, align: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr_sub2", scope: !138, file: !14, line: 365, baseType: !18, size: 64, align: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_sqr", scope: !138, file: !14, line: 371, baseType: !18, size: 64, align: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "d_tMask", scope: !138, file: !14, line: 377, baseType: !18, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask", scope: !138, file: !14, line: 383, baseType: !18, size: 64, align: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask_conv", scope: !138, file: !14, line: 389, baseType: !18, size: 64, align: 64, offset: 1216)
!161 = !{!162}
!162 = !DISubrange(count: 51)
!163 = distinct !DIGlobalVariable(name: "in_partial_sum", scope: !164, file: !165, line: 52, type: !222, isLocal: true, isDefinition: true, variable: [51 x float] addrspace(3)* @_ZZ6kernelvE14in_partial_sum)
!164 = distinct !DISubprogram(name: "kernel", linkageName: "_Z6kernelv", scope: !165, file: !165, line: 7, type: !166, isLocal: false, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !168)
!165 = !DIFile(filename: "Results/heartwall/kernel.cu", directory: "/home/ec2-user/DynamicAnalyis")
!166 = !DISubroutineType(types: !167)
!167 = !{null}
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!169 = !DILocalVariable(name: "d_in", scope: !164, file: !165, line: 13, type: !18)
!170 = !DILocalVariable(name: "rot_row", scope: !164, file: !165, line: 14, type: !9)
!171 = !DILocalVariable(name: "rot_col", scope: !164, file: !165, line: 15, type: !9)
!172 = !DILocalVariable(name: "in2_rowlow", scope: !164, file: !165, line: 16, type: !9)
!173 = !DILocalVariable(name: "in2_collow", scope: !164, file: !165, line: 17, type: !9)
!174 = !DILocalVariable(name: "ic", scope: !164, file: !165, line: 18, type: !9)
!175 = !DILocalVariable(name: "jc", scope: !164, file: !165, line: 19, type: !9)
!176 = !DILocalVariable(name: "jp1", scope: !164, file: !165, line: 20, type: !9)
!177 = !DILocalVariable(name: "ja1", scope: !164, file: !165, line: 21, type: !9)
!178 = !DILocalVariable(name: "ja2", scope: !164, file: !165, line: 21, type: !9)
!179 = !DILocalVariable(name: "ip1", scope: !164, file: !165, line: 22, type: !9)
!180 = !DILocalVariable(name: "ia1", scope: !164, file: !165, line: 23, type: !9)
!181 = !DILocalVariable(name: "ia2", scope: !164, file: !165, line: 23, type: !9)
!182 = !DILocalVariable(name: "ja", scope: !164, file: !165, line: 24, type: !9)
!183 = !DILocalVariable(name: "jb", scope: !164, file: !165, line: 24, type: !9)
!184 = !DILocalVariable(name: "ia", scope: !164, file: !165, line: 25, type: !9)
!185 = !DILocalVariable(name: "ib", scope: !164, file: !165, line: 25, type: !9)
!186 = !DILocalVariable(name: "s", scope: !164, file: !165, line: 26, type: !10)
!187 = !DILocalVariable(name: "i", scope: !164, file: !165, line: 27, type: !9)
!188 = !DILocalVariable(name: "j", scope: !164, file: !165, line: 28, type: !9)
!189 = !DILocalVariable(name: "row", scope: !164, file: !165, line: 29, type: !9)
!190 = !DILocalVariable(name: "col", scope: !164, file: !165, line: 30, type: !9)
!191 = !DILocalVariable(name: "ori_row", scope: !164, file: !165, line: 31, type: !9)
!192 = !DILocalVariable(name: "ori_col", scope: !164, file: !165, line: 32, type: !9)
!193 = !DILocalVariable(name: "position", scope: !164, file: !165, line: 33, type: !9)
!194 = !DILocalVariable(name: "sum", scope: !164, file: !165, line: 34, type: !10)
!195 = !DILocalVariable(name: "pos_ori", scope: !164, file: !165, line: 35, type: !9)
!196 = !DILocalVariable(name: "temp", scope: !164, file: !165, line: 36, type: !10)
!197 = !DILocalVariable(name: "temp2", scope: !164, file: !165, line: 37, type: !10)
!198 = !DILocalVariable(name: "location", scope: !164, file: !165, line: 38, type: !9)
!199 = !DILocalVariable(name: "cent", scope: !164, file: !165, line: 39, type: !9)
!200 = !DILocalVariable(name: "tMask_row", scope: !164, file: !165, line: 40, type: !9)
!201 = !DILocalVariable(name: "tMask_col", scope: !164, file: !165, line: 41, type: !9)
!202 = !DILocalVariable(name: "largest_value_current", scope: !164, file: !165, line: 42, type: !10)
!203 = !DILocalVariable(name: "largest_value", scope: !164, file: !165, line: 43, type: !10)
!204 = !DILocalVariable(name: "largest_coordinate_current", scope: !164, file: !165, line: 44, type: !9)
!205 = !DILocalVariable(name: "largest_coordinate", scope: !164, file: !165, line: 45, type: !9)
!206 = !DILocalVariable(name: "fin_max_val", scope: !164, file: !165, line: 46, type: !10)
!207 = !DILocalVariable(name: "fin_max_coo", scope: !164, file: !165, line: 47, type: !9)
!208 = !DILocalVariable(name: "largest_row", scope: !164, file: !165, line: 48, type: !9)
!209 = !DILocalVariable(name: "largest_col", scope: !164, file: !165, line: 49, type: !9)
!210 = !DILocalVariable(name: "offset_row", scope: !164, file: !165, line: 50, type: !9)
!211 = !DILocalVariable(name: "offset_col", scope: !164, file: !165, line: 51, type: !9)
!212 = !DILocalVariable(name: "mean", scope: !164, file: !165, line: 56, type: !10)
!213 = !DILocalVariable(name: "mean_sqr", scope: !164, file: !165, line: 57, type: !10)
!214 = !DILocalVariable(name: "variance", scope: !164, file: !165, line: 58, type: !10)
!215 = !DILocalVariable(name: "deviation", scope: !164, file: !165, line: 59, type: !10)
!216 = !DILocalVariable(name: "pointer", scope: !164, file: !165, line: 63, type: !9)
!217 = !DILocalVariable(name: "ori_pointer", scope: !164, file: !165, line: 65, type: !9)
!218 = !DILocalVariable(name: "loc_pointer", scope: !164, file: !165, line: 66, type: !9)
!219 = !DILocalVariable(name: "bx", scope: !164, file: !165, line: 72, type: !9)
!220 = !DILocalVariable(name: "tx", scope: !164, file: !165, line: 73, type: !9)
!221 = !DILocalVariable(name: "ei_new", scope: !164, file: !165, line: 74, type: !9)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1632, align: 32, elements: !161)
!223 = distinct !DIGlobalVariable(name: "in_sqr_partial_sum", scope: !164, file: !165, line: 53, type: !222, isLocal: true, isDefinition: true, variable: [51 x float] addrspace(3)* @_ZZ6kernelvE18in_sqr_partial_sum)
!224 = distinct !DIGlobalVariable(name: "in_final_sum", scope: !164, file: !165, line: 54, type: !10, isLocal: true, isDefinition: true, variable: float addrspace(3)* @_ZZ6kernelvE12in_final_sum)
!225 = distinct !DIGlobalVariable(name: "in_sqr_final_sum", scope: !164, file: !165, line: 55, type: !10, isLocal: true, isDefinition: true, variable: float addrspace(3)* @_ZZ6kernelvE16in_sqr_final_sum)
!226 = distinct !DIGlobalVariable(name: "denomT", scope: !164, file: !165, line: 60, type: !10, isLocal: true, isDefinition: true, variable: float addrspace(3)* @_ZZ6kernelvE6denomT)
!227 = distinct !DIGlobalVariable(name: "par_max_val", scope: !164, file: !165, line: 61, type: !228, isLocal: true, isDefinition: true, variable: [131 x float] addrspace(3)* @_ZZ6kernelvE11par_max_val)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4192, align: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 131)
!231 = distinct !DIGlobalVariable(name: "par_max_coo", scope: !164, file: !165, line: 62, type: !232, isLocal: true, isDefinition: true, variable: [131 x i32] addrspace(3)* @_ZZ6kernelvE11par_max_coo)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4192, align: 32, elements: !229)
!233 = distinct !DIGlobalVariable(name: "d_in_mod_temp", scope: !164, file: !165, line: 64, type: !234, isLocal: true, isDefinition: true, variable: [2601 x float] addrspace(3)* @_ZZ6kernelvE13d_in_mod_temp)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 83232, align: 32, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 2601)
!237 = distinct !DIGlobalVariable(name: "warpSize", scope: !0, file: !238, line: 120, type: !239, isLocal: true, isDefinition: true, variable: i32 32)
!238 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/cuda_builtin_vars.h", directory: "/home/ec2-user/DynamicAnalyis")
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!240 = !{!241, !248, !252, !254, !256, !258, !260, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !292, !296, !298, !300, !302, !306, !310, !312, !314, !319, !323, !325, !327, !329, !331, !333, !335, !337, !339, !344, !348, !350, !352, !356, !358, !360, !362, !364, !366, !370, !372, !374, !378, !386, !390, !392, !394, !398, !400, !402, !406, !408, !410, !414, !416, !418, !420, !422, !427, !429, !431, !433, !435, !440, !442, !444, !448, !450, !452, !454, !456, !458, !460, !462, !466, !470, !472, !474, !479, !481, !483, !485, !487, !489, !491, !495, !501, !503, !507, !512, !515, !519, !523, !536, !540, !544, !548, !552, !557, !559, !563, !567, !571, !579, !583, !587, !591, !595, !600, !606, !610, !614, !616, !624, !628, !636, !638, !640, !644, !648, !652, !657, !661, !666, !667, !668, !669, !672, !673, !674, !675, !676, !677, !678, !681, !683, !685, !687, !689, !691, !693, !695, !698, !700, !702, !704, !706, !708, !710, !712, !714, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !768, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !791, !793, !795, !797}
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !244, line: 189)
!242 = !DINamespace(name: "std", scope: null, file: !243, line: 188)
!243 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/__clang_cuda_math_forward_declares.h", directory: "/home/ec2-user/DynamicAnalyis")
!244 = !DISubprogram(name: "abs", linkageName: "_ZL3absx", scope: !243, file: !243, line: 44, type: !245, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !247}
!247 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !249, line: 190)
!249 = !DISubprogram(name: "acos", linkageName: "_ZL4acosf", scope: !243, file: !243, line: 46, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{!10, !10}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !253, line: 191)
!253 = !DISubprogram(name: "acosh", linkageName: "_ZL5acoshf", scope: !243, file: !243, line: 48, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !255, line: 192)
!255 = !DISubprogram(name: "asin", linkageName: "_ZL4asinf", scope: !243, file: !243, line: 50, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !257, line: 193)
!257 = !DISubprogram(name: "asinh", linkageName: "_ZL5asinhf", scope: !243, file: !243, line: 52, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !259, line: 194)
!259 = !DISubprogram(name: "atan", linkageName: "_ZL4atanf", scope: !243, file: !243, line: 56, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !261, line: 195)
!261 = !DISubprogram(name: "atan2", linkageName: "_ZL5atan2ff", scope: !243, file: !243, line: 54, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!10, !10, !10}
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !265, line: 196)
!265 = !DISubprogram(name: "atanh", linkageName: "_ZL5atanhf", scope: !243, file: !243, line: 58, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !267, line: 197)
!267 = !DISubprogram(name: "cbrt", linkageName: "_ZL4cbrtf", scope: !243, file: !243, line: 60, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !269, line: 198)
!269 = !DISubprogram(name: "ceil", linkageName: "_ZL4ceilf", scope: !243, file: !243, line: 62, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !271, line: 199)
!271 = !DISubprogram(name: "copysign", linkageName: "_ZL8copysignff", scope: !243, file: !243, line: 64, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !273, line: 200)
!273 = !DISubprogram(name: "cos", linkageName: "_ZL3cosf", scope: !243, file: !243, line: 66, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !275, line: 201)
!275 = !DISubprogram(name: "cosh", linkageName: "_ZL4coshf", scope: !243, file: !243, line: 68, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !277, line: 202)
!277 = !DISubprogram(name: "erf", linkageName: "_ZL3erff", scope: !243, file: !243, line: 72, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !279, line: 203)
!279 = !DISubprogram(name: "erfc", linkageName: "_ZL4erfcf", scope: !243, file: !243, line: 70, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !281, line: 204)
!281 = !DISubprogram(name: "exp", linkageName: "_ZL3expf", scope: !243, file: !243, line: 76, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !283, line: 205)
!283 = !DISubprogram(name: "exp2", linkageName: "_ZL4exp2f", scope: !243, file: !243, line: 74, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !285, line: 206)
!285 = !DISubprogram(name: "expm1", linkageName: "_ZL5expm1f", scope: !243, file: !243, line: 78, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !287, line: 207)
!287 = !DISubprogram(name: "fabs", linkageName: "_ZL4fabsf", scope: !243, file: !243, line: 80, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !289, line: 208)
!289 = !DISubprogram(name: "fdim", linkageName: "_ZL4fdimff", scope: !243, file: !243, line: 82, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !291, line: 209)
!291 = !DISubprogram(name: "floor", linkageName: "_ZL5floorf", scope: !243, file: !243, line: 84, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !293, line: 210)
!293 = !DISubprogram(name: "fma", linkageName: "_ZL3fmafff", scope: !243, file: !243, line: 86, type: !294, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{!10, !10, !10, !10}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !297, line: 211)
!297 = !DISubprogram(name: "fmax", linkageName: "_ZL4fmaxff", scope: !243, file: !243, line: 88, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !299, line: 212)
!299 = !DISubprogram(name: "fmin", linkageName: "_ZL4fminff", scope: !243, file: !243, line: 90, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !301, line: 213)
!301 = !DISubprogram(name: "fmod", linkageName: "_ZL4fmodff", scope: !243, file: !243, line: 92, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !303, line: 214)
!303 = !DISubprogram(name: "fpclassify", linkageName: "_ZL10fpclassifyf", scope: !243, file: !243, line: 94, type: !304, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!9, !10}
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !307, line: 215)
!307 = !DISubprogram(name: "frexp", linkageName: "_ZL5frexpfPi", scope: !243, file: !243, line: 96, type: !308, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{!10, !10, !36}
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !311, line: 216)
!311 = !DISubprogram(name: "hypot", linkageName: "_ZL5hypotff", scope: !243, file: !243, line: 98, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !313, line: 217)
!313 = !DISubprogram(name: "ilogb", linkageName: "_ZL5ilogbf", scope: !243, file: !243, line: 100, type: !304, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !315, line: 218)
!315 = !DISubprogram(name: "isfinite", linkageName: "_ZL8isfinitef", scope: !243, file: !243, line: 102, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!316 = !DISubroutineType(types: !317)
!317 = !{!318, !10}
!318 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !320, line: 219)
!320 = !DISubprogram(name: "isgreater", linkageName: "_ZL9isgreaterff", scope: !243, file: !243, line: 106, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!318, !10, !10}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !324, line: 220)
!324 = !DISubprogram(name: "isgreaterequal", linkageName: "_ZL14isgreaterequalff", scope: !243, file: !243, line: 105, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !326, line: 221)
!326 = !DISubprogram(name: "isinf", linkageName: "_ZL5isinff", scope: !243, file: !243, line: 108, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !328, line: 222)
!328 = !DISubprogram(name: "isless", linkageName: "_ZL6islessff", scope: !243, file: !243, line: 112, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !330, line: 223)
!330 = !DISubprogram(name: "islessequal", linkageName: "_ZL11islessequalff", scope: !243, file: !243, line: 111, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !332, line: 224)
!332 = !DISubprogram(name: "islessgreater", linkageName: "_ZL13islessgreaterff", scope: !243, file: !243, line: 114, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !334, line: 225)
!334 = !DISubprogram(name: "isnan", linkageName: "_ZL5isnanf", scope: !243, file: !243, line: 116, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !336, line: 226)
!336 = !DISubprogram(name: "isnormal", linkageName: "_ZL8isnormalf", scope: !243, file: !243, line: 118, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !338, line: 227)
!338 = !DISubprogram(name: "isunordered", linkageName: "_ZL11isunorderedff", scope: !243, file: !243, line: 120, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !340, line: 228)
!340 = !DISubprogram(name: "labs", linkageName: "_ZL4labsl", scope: !243, file: !243, line: 121, type: !341, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !343}
!343 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !345, line: 229)
!345 = !DISubprogram(name: "ldexp", linkageName: "_ZL5ldexpfi", scope: !243, file: !243, line: 123, type: !346, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!10, !10, !9}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !349, line: 230)
!349 = !DISubprogram(name: "lgamma", linkageName: "_ZL6lgammaf", scope: !243, file: !243, line: 125, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !351, line: 231)
!351 = !DISubprogram(name: "llabs", linkageName: "_ZL5llabsx", scope: !243, file: !243, line: 126, type: !245, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !353, line: 232)
!353 = !DISubprogram(name: "llrint", linkageName: "_ZL6llrintf", scope: !243, file: !243, line: 128, type: !354, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!247, !10}
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !357, line: 233)
!357 = !DISubprogram(name: "log", linkageName: "_ZL3logf", scope: !243, file: !243, line: 138, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !359, line: 234)
!359 = !DISubprogram(name: "log10", linkageName: "_ZL5log10f", scope: !243, file: !243, line: 130, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !361, line: 235)
!361 = !DISubprogram(name: "log1p", linkageName: "_ZL5log1pf", scope: !243, file: !243, line: 132, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !363, line: 236)
!363 = !DISubprogram(name: "log2", linkageName: "_ZL4log2f", scope: !243, file: !243, line: 134, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !365, line: 237)
!365 = !DISubprogram(name: "logb", linkageName: "_ZL4logbf", scope: !243, file: !243, line: 136, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !367, line: 238)
!367 = !DISubprogram(name: "lrint", linkageName: "_ZL5lrintf", scope: !243, file: !243, line: 140, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!343, !10}
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !371, line: 239)
!371 = !DISubprogram(name: "lround", linkageName: "_ZL6lroundf", scope: !243, file: !243, line: 142, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !373, line: 240)
!373 = !DISubprogram(name: "llround", linkageName: "_ZL7llroundf", scope: !243, file: !243, line: 143, type: !354, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !375, line: 241)
!375 = !DISubprogram(name: "modf", linkageName: "_ZL4modffPf", scope: !243, file: !243, line: 145, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!10, !10, !18}
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !379, line: 242)
!379 = !DISubprogram(name: "nan", linkageName: "_ZL3nanPKc", scope: !243, file: !243, line: 146, type: !380, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !383}
!382 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !387, line: 243)
!387 = !DISubprogram(name: "nanf", linkageName: "_ZL4nanfPKc", scope: !243, file: !243, line: 147, type: !388, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!10, !383}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !391, line: 244)
!391 = !DISubprogram(name: "nearbyint", linkageName: "_ZL9nearbyintf", scope: !243, file: !243, line: 149, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !393, line: 245)
!393 = !DISubprogram(name: "nextafter", linkageName: "_ZL9nextafterff", scope: !243, file: !243, line: 151, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !395, line: 246)
!395 = !DISubprogram(name: "nexttoward", linkageName: "_ZL10nexttowardfd", scope: !243, file: !243, line: 153, type: !396, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!10, !10, !382}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !399, line: 247)
!399 = !DISubprogram(name: "pow", linkageName: "_ZL3powfi", scope: !243, file: !243, line: 158, type: !346, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !401, line: 248)
!401 = !DISubprogram(name: "remainder", linkageName: "_ZL9remainderff", scope: !243, file: !243, line: 160, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !403, line: 249)
!403 = !DISubprogram(name: "remquo", linkageName: "_ZL6remquoffPi", scope: !243, file: !243, line: 162, type: !404, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{!10, !10, !10, !36}
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !407, line: 250)
!407 = !DISubprogram(name: "rint", linkageName: "_ZL4rintf", scope: !243, file: !243, line: 164, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !409, line: 251)
!409 = !DISubprogram(name: "round", linkageName: "_ZL5roundf", scope: !243, file: !243, line: 166, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !411, line: 252)
!411 = !DISubprogram(name: "scalbln", linkageName: "_ZL7scalblnfl", scope: !243, file: !243, line: 168, type: !412, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!10, !10, !343}
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !415, line: 253)
!415 = !DISubprogram(name: "scalbn", linkageName: "_ZL6scalbnfi", scope: !243, file: !243, line: 170, type: !346, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !417, line: 254)
!417 = !DISubprogram(name: "signbit", linkageName: "_ZL7signbitf", scope: !243, file: !243, line: 172, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !419, line: 255)
!419 = !DISubprogram(name: "sin", linkageName: "_ZL3sinf", scope: !243, file: !243, line: 174, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !421, line: 256)
!421 = !DISubprogram(name: "sinh", linkageName: "_ZL4sinhf", scope: !243, file: !243, line: 176, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !423, line: 257)
!423 = distinct !DISubprogram(name: "sqrt", linkageName: "_ZL4sqrtf", scope: !424, file: !424, line: 147, type: !250, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !425)
!424 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/__clang_cuda_cmath.h", directory: "/home/ec2-user/DynamicAnalyis")
!425 = !{!426}
!426 = !DILocalVariable(name: "__x", arg: 1, scope: !423, file: !424, line: 147, type: !10)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !428, line: 258)
!428 = !DISubprogram(name: "tan", linkageName: "_ZL3tanf", scope: !243, file: !243, line: 180, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !430, line: 259)
!430 = !DISubprogram(name: "tanh", linkageName: "_ZL4tanhf", scope: !243, file: !243, line: 182, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !432, line: 260)
!432 = !DISubprogram(name: "tgamma", linkageName: "_ZL6tgammaf", scope: !243, file: !243, line: 184, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !434, line: 261)
!434 = !DISubprogram(name: "trunc", linkageName: "_ZL5truncf", scope: !243, file: !243, line: 186, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !436, line: 102)
!436 = !DISubprogram(name: "acos", scope: !437, file: !437, line: 54, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DIFile(filename: "/usr/include/bits/mathcalls.h", directory: "/home/ec2-user/DynamicAnalyis")
!438 = !DISubroutineType(types: !439)
!439 = !{!382, !382}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !441, line: 121)
!441 = !DISubprogram(name: "asin", scope: !437, file: !437, line: 56, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !443, line: 140)
!443 = !DISubprogram(name: "atan", scope: !437, file: !437, line: 58, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !445, line: 159)
!445 = !DISubprogram(name: "atan2", scope: !437, file: !437, line: 60, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!382, !382, !382}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !449, line: 180)
!449 = !DISubprogram(name: "ceil", scope: !437, file: !437, line: 179, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !451, line: 199)
!451 = !DISubprogram(name: "cos", scope: !437, file: !437, line: 63, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !453, line: 218)
!453 = !DISubprogram(name: "cosh", scope: !437, file: !437, line: 72, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !455, line: 237)
!455 = !DISubprogram(name: "exp", scope: !437, file: !437, line: 100, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !457, line: 256)
!457 = !DISubprogram(name: "fabs", scope: !437, file: !437, line: 182, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !459, line: 275)
!459 = !DISubprogram(name: "floor", scope: !437, file: !437, line: 185, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !461, line: 294)
!461 = !DISubprogram(name: "fmod", scope: !437, file: !437, line: 188, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !463, line: 315)
!463 = !DISubprogram(name: "frexp", scope: !437, file: !437, line: 103, type: !464, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{!382, !382, !36}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !467, line: 334)
!467 = !DISubprogram(name: "ldexp", scope: !437, file: !437, line: 106, type: !468, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!382, !382, !9}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !471, line: 353)
!471 = !DISubprogram(name: "log", scope: !437, file: !437, line: 109, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !473, line: 372)
!473 = !DISubprogram(name: "log10", scope: !437, file: !437, line: 112, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !475, line: 391)
!475 = !DISubprogram(name: "modf", scope: !437, file: !437, line: 115, type: !476, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{!382, !382, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !480, line: 403)
!480 = !DISubprogram(name: "pow", scope: !437, file: !437, line: 154, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !482, line: 440)
!482 = !DISubprogram(name: "sin", scope: !437, file: !437, line: 65, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !484, line: 459)
!484 = !DISubprogram(name: "sinh", scope: !437, file: !437, line: 74, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !486, line: 478)
!486 = !DISubprogram(name: "sqrt", scope: !437, file: !437, line: 157, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !488, line: 497)
!488 = !DISubprogram(name: "tan", scope: !437, file: !437, line: 67, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !490, line: 516)
!490 = !DISubprogram(name: "tanh", scope: !437, file: !437, line: 76, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !492, line: 118)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !493, line: 101, baseType: !494)
!493 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/ec2-user/DynamicAnalyis")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !496, line: 119)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !493, line: 109, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 105, size: 128, align: 64, elements: !498, identifier: "_ZTS6ldiv_t")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !497, file: !493, line: 107, baseType: !343, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !497, file: !493, line: 108, baseType: !343, size: 64, align: 64, offset: 64)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !502, line: 121)
!502 = !DISubprogram(name: "abort", scope: !493, file: !493, line: 514, type: !166, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !504, line: 122)
!504 = !DISubprogram(name: "abs", scope: !493, file: !493, line: 770, type: !505, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{!9, !9}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !508, line: 123)
!508 = !DISubprogram(name: "atexit", scope: !493, file: !493, line: 518, type: !509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{!9, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !513, line: 129)
!513 = !DISubprogram(name: "atof", scope: !514, file: !514, line: 26, type: !380, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "/home/ec2-user/DynamicAnalyis")
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !516, line: 130)
!516 = !DISubprogram(name: "atoi", scope: !493, file: !493, line: 278, type: !517, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!9, !383}
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !520, line: 131)
!520 = !DISubprogram(name: "atol", scope: !493, file: !493, line: 283, type: !521, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{!343, !383}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !524, line: 132)
!524 = !DISubprogram(name: "bsearch", scope: !493, file: !493, line: 754, type: !525, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !528, !528, !530, !530, !532}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 62, baseType: !8)
!531 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/ec2-user/DynamicAnalyis")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !493, line: 741, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!9, !528, !528}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !537, line: 133)
!537 = !DISubprogram(name: "calloc", scope: !493, file: !493, line: 467, type: !538, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{!527, !530, !530}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !541, line: 134)
!541 = !DISubprogram(name: "div", scope: !493, file: !493, line: 784, type: !542, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{!492, !9, !9}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !545, line: 135)
!545 = !DISubprogram(name: "exit", scope: !493, file: !493, line: 542, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !9}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !549, line: 136)
!549 = !DISubprogram(name: "free", scope: !493, file: !493, line: 482, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !527}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !553, line: 137)
!553 = !DISubprogram(name: "getenv", scope: !493, file: !493, line: 563, type: !554, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !383}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !558, line: 138)
!558 = !DISubprogram(name: "labs", scope: !493, file: !493, line: 771, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !560, line: 139)
!560 = !DISubprogram(name: "ldiv", scope: !493, file: !493, line: 786, type: !561, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!561 = !DISubroutineType(types: !562)
!562 = !{!496, !343, !343}
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !564, line: 140)
!564 = !DISubprogram(name: "malloc", scope: !493, file: !493, line: 465, type: !565, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!527, !530}
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !568, line: 142)
!568 = !DISubprogram(name: "mblen", scope: !493, file: !493, line: 859, type: !569, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!9, !383, !530}
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !572, line: 143)
!572 = !DISubprogram(name: "mbstowcs", scope: !493, file: !493, line: 870, type: !573, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!530, !575, !578, !530}
!575 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !383)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !580, line: 144)
!580 = !DISubprogram(name: "mbtowc", scope: !493, file: !493, line: 862, type: !581, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !DISubroutineType(types: !582)
!582 = !{!9, !575, !578, !530}
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !584, line: 146)
!584 = !DISubprogram(name: "qsort", scope: !493, file: !493, line: 760, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !527, !530, !530, !532}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !588, line: 152)
!588 = !DISubprogram(name: "rand", scope: !493, file: !493, line: 374, type: !589, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!9}
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !592, line: 153)
!592 = !DISubprogram(name: "realloc", scope: !493, file: !493, line: 479, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!527, !527, !530}
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !596, line: 154)
!596 = !DISubprogram(name: "srand", scope: !493, file: !493, line: 376, type: !597, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !599}
!599 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !601, line: 155)
!601 = !DISubprogram(name: "strtod", scope: !493, file: !493, line: 164, type: !602, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!382, !578, !604}
!604 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !607, line: 156)
!607 = !DISubprogram(name: "strtol", scope: !493, file: !493, line: 183, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!608 = !DISubroutineType(types: !609)
!609 = !{!343, !578, !604, !9}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !611, line: 157)
!611 = !DISubprogram(name: "strtoul", scope: !493, file: !493, line: 187, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{!8, !578, !604, !9}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !615, line: 158)
!615 = !DISubprogram(name: "system", scope: !493, file: !493, line: 716, type: !517, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !617, line: 160)
!617 = !DISubprogram(name: "wcstombs", scope: !493, file: !493, line: 873, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{!530, !620, !621, !530}
!620 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !556)
!621 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !625, line: 161)
!625 = !DISubprogram(name: "wctomb", scope: !493, file: !493, line: 866, type: !626, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{!9, !556, !577}
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !631, line: 201)
!629 = !DINamespace(name: "__gnu_cxx", scope: null, file: !630, line: 68)
!630 = !DIFile(filename: "/usr/include/c++/4.8.3/bits/cpp_type_traits.h", directory: "/home/ec2-user/DynamicAnalyis")
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !493, line: 121, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 117, size: 128, align: 64, elements: !633, identifier: "_ZTS7lldiv_t")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !632, file: !493, line: 119, baseType: !247, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !632, file: !493, line: 120, baseType: !247, size: 64, align: 64, offset: 64)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !637, line: 207)
!637 = !DISubprogram(name: "_Exit", scope: !493, file: !493, line: 556, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !639, line: 211)
!639 = !DISubprogram(name: "llabs", scope: !493, file: !493, line: 775, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !641, line: 217)
!641 = !DISubprogram(name: "lldiv", scope: !493, file: !493, line: 792, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{!631, !247, !247}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !645, line: 228)
!645 = !DISubprogram(name: "atoll", scope: !493, file: !493, line: 292, type: !646, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!247, !383}
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !649, line: 229)
!649 = !DISubprogram(name: "strtoll", scope: !493, file: !493, line: 209, type: !650, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{!247, !578, !604, !9}
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !653, line: 230)
!653 = !DISubprogram(name: "strtoull", scope: !493, file: !493, line: 214, type: !654, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !578, !604, !9}
!656 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !658, line: 232)
!658 = !DISubprogram(name: "strtof", scope: !493, file: !493, line: 172, type: !659, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{!10, !578, !604}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !629, entity: !662, line: 233)
!662 = !DISubprogram(name: "strtold", scope: !493, file: !493, line: 175, type: !663, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !578, !604}
!665 = !DIBasicType(name: "long double", size: 64, align: 64, encoding: DW_ATE_float)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !631, line: 241)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !637, line: 243)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !639, line: 245)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !670, line: 246)
!670 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !629, file: !671, line: 214, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!671 = !DIFile(filename: "/usr/include/c++/4.8.3/cstdlib", directory: "/home/ec2-user/DynamicAnalyis")
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !641, line: 247)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !645, line: 249)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !658, line: 250)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !649, line: 251)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !653, line: 252)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !662, line: 253)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !679, line: 366)
!679 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !680, file: !680, line: 1300, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!680 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/ec2-user/DynamicAnalyis")
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !682, line: 367)
!682 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !680, file: !680, line: 1328, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !684, line: 368)
!684 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !680, file: !680, line: 1295, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !686, line: 369)
!686 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !680, file: !680, line: 1333, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !688, line: 370)
!688 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !680, file: !680, line: 1285, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !690, line: 371)
!690 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !680, file: !680, line: 1290, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !692, line: 372)
!692 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !680, file: !680, line: 1338, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !694, line: 373)
!694 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !680, file: !680, line: 1388, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !696, line: 374)
!696 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !697, file: !697, line: 667, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!697 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/ec2-user/DynamicAnalyis")
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !699, line: 375)
!699 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !680, file: !680, line: 1147, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !701, line: 376)
!701 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !680, file: !680, line: 1201, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !703, line: 377)
!703 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !680, file: !680, line: 1270, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !705, line: 378)
!705 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !680, file: !680, line: 1448, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !707, line: 379)
!707 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !680, file: !680, line: 1438, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !709, line: 380)
!709 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !697, file: !697, line: 657, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !711, line: 381)
!711 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !680, file: !680, line: 1252, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !713, line: 382)
!713 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !680, file: !680, line: 1343, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !715, line: 383)
!715 = distinct !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !697, file: !697, line: 607, type: !250, isLocal: true, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !716)
!716 = !{!717}
!717 = !DILocalVariable(name: "f", arg: 1, scope: !715, file: !697, line: 607, type: !10)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !719, line: 384)
!719 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !680, file: !680, line: 1574, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !721, line: 385)
!721 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !697, file: !697, line: 597, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !723, line: 386)
!723 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !680, file: !680, line: 1526, type: !294, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !725, line: 387)
!725 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !697, file: !697, line: 622, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !727, line: 388)
!727 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !697, file: !697, line: 617, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !729, line: 389)
!729 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !680, file: !680, line: 1511, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !731, line: 390)
!731 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !680, file: !680, line: 1501, type: !308, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !733, line: 391)
!733 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !680, file: !680, line: 1348, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !735, line: 392)
!735 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !680, file: !680, line: 1579, type: !304, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !737, line: 393)
!737 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !680, file: !680, line: 1478, type: !346, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !739, line: 394)
!739 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !680, file: !680, line: 1473, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !741, line: 395)
!741 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !680, file: !680, line: 1107, type: !354, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !743, line: 396)
!743 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !680, file: !680, line: 1560, type: !354, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !745, line: 397)
!745 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !680, file: !680, line: 1314, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !747, line: 398)
!747 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !680, file: !680, line: 1323, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !749, line: 399)
!749 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !680, file: !680, line: 1243, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !751, line: 400)
!751 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !680, file: !680, line: 1584, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !753, line: 401)
!753 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !680, file: !680, line: 1305, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !755, line: 402)
!755 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !680, file: !680, line: 1098, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !757, line: 403)
!757 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !680, file: !680, line: 1565, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !759, line: 404)
!759 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !680, file: !680, line: 1506, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !761, line: 405)
!761 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !680, file: !680, line: 1112, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !763, line: 406)
!763 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !680, file: !680, line: 1176, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !765, line: 407)
!765 = !DISubprogram(name: "nexttowardf", scope: !437, file: !437, line: 285, type: !766, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!766 = !DISubroutineType(types: !767)
!767 = !{!10, !10, !665}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !765, line: 408)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !770, line: 409)
!770 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !680, file: !680, line: 1541, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !772, line: 410)
!772 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !680, file: !680, line: 1516, type: !262, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !774, line: 411)
!774 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !680, file: !680, line: 1521, type: !404, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !776, line: 412)
!776 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !680, file: !680, line: 1093, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !778, line: 413)
!778 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !680, file: !680, line: 1555, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !780, line: 414)
!780 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !680, file: !680, line: 1488, type: !412, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !782, line: 415)
!782 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !680, file: !680, line: 1483, type: !346, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !784, line: 416)
!784 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !680, file: !680, line: 1192, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !786, line: 417)
!786 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !680, file: !680, line: 1275, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !788, line: 418)
!788 = distinct !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !697, file: !697, line: 907, type: !250, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !789)
!789 = !{!790}
!790 = !DILocalVariable(name: "x", arg: 1, scope: !788, file: !697, line: 907, type: !10)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !792, line: 419)
!792 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !680, file: !680, line: 1234, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !794, line: 420)
!794 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !680, file: !680, line: 1280, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !796, line: 421)
!796 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !680, file: !680, line: 1550, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !242, entity: !798, line: 422)
!798 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !697, file: !697, line: 662, type: !250, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!799 = !{void ()* @_Z6kernelv, !"kernel", i32 1}
!800 = !{null, !"align", i32 8}
!801 = !{null, !"align", i32 8, !"align", i32 65544, !"align", i32 131080}
!802 = !{null, !"align", i32 16}
!803 = !{null, !"align", i32 16, !"align", i32 65552, !"align", i32 131088}
!804 = !{i32 2, !"Dwarf Version", i32 4}
!805 = !{i32 2, !"Debug Info Version", i32 3}
!806 = !{i32 4, !"nvvm-reflect-ftz", i32 0}
!807 = !{!"clang version 4.0.0 (trunk 279478) (llvm/trunk 279476)"}
!808 = !{i32 1, i32 2}
!809 = distinct !DISubprogram(name: "getNthBit", linkageName: "_Z9getNthBitji", scope: !5, file: !5, line: 11, type: !810, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{!9, !599, !9}
!812 = !{!813, !814}
!813 = !DILocalVariable(name: "bitArray", arg: 1, scope: !809, file: !5, line: 11, type: !599)
!814 = !DILocalVariable(name: "nth", arg: 2, scope: !809, file: !5, line: 11, type: !9)
!815 = !DIExpression()
!816 = !DILocation(line: 11, column: 39, scope: !809)
!817 = !DILocation(line: 11, column: 53, scope: !809)
!818 = !DILocation(line: 12, column: 24, scope: !809)
!819 = !DILocation(line: 12, column: 12, scope: !809)
!820 = !DILocation(line: 12, column: 3, scope: !809)
!821 = distinct !DISubprogram(name: "countCacheLines", linkageName: "_Z15countCacheLinesPvPcS0_S0_iiii", scope: !5, file: !5, line: 34, type: !822, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !527, !556, !556, !556, !9, !9, !9, !9}
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !839, !840, !842, !844, !849, !850, !853, !855, !856, !858, !862, !864}
!825 = !DILocalVariable(name: "addressP", arg: 1, scope: !821, file: !5, line: 34, type: !527)
!826 = !DILocalVariable(name: "moduleName", arg: 2, scope: !821, file: !5, line: 34, type: !556)
!827 = !DILocalVariable(name: "functionName", arg: 3, scope: !821, file: !5, line: 34, type: !556)
!828 = !DILocalVariable(name: "loadOrStore", arg: 4, scope: !821, file: !5, line: 35, type: !556)
!829 = !DILocalVariable(name: "lineNum", arg: 5, scope: !821, file: !5, line: 35, type: !9)
!830 = !DILocalVariable(name: "columnNum", arg: 6, scope: !821, file: !5, line: 35, type: !9)
!831 = !DILocalVariable(name: "dynamicId", arg: 7, scope: !821, file: !5, line: 36, type: !9)
!832 = !DILocalVariable(name: "typeSize", arg: 8, scope: !821, file: !5, line: 36, type: !9)
!833 = !DILocalVariable(name: "activeThreads", scope: !821, file: !5, line: 43, type: !9)
!834 = !DILocalVariable(name: "address", scope: !821, file: !5, line: 47, type: !4)
!835 = !DILocalVariable(name: "addrArray", scope: !821, file: !5, line: 52, type: !836)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, align: 64, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 64)
!839 = !DILocalVariable(name: "reduceThread", scope: !821, file: !5, line: 55, type: !9)
!840 = !DILocalVariable(name: "i", scope: !841, file: !5, line: 56, type: !9)
!841 = distinct !DILexicalBlock(scope: !821, file: !5, line: 56, column: 3)
!842 = !DILocalVariable(name: "i", scope: !843, file: !5, line: 64, type: !9)
